nc: 80  # Number of classes

scales:
  n: [0.33, 0.25, 1024]  # nano model scaling
  s: [0.33, 0.50, 1024]
# -----------------------
# Backbone
# -----------------------
backbone:
  - [-1, 1, Conv_ZoomAtt, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, Conv_ZoomAtt, [64, 3, 1]]          # 1
  - [-1, 1, Conv_ZoomAtt, [128, 3, 2]]         # 2 - P2/4
  - [-1, 2, C2f, [128]]                        # 3
  - [-1, 1, Conv_TODAM, [128, 3, 1]]           # 4
  - [-1, 1, Conv_ZoomAtt, [256, 3, 2]]         # 5 - P3/8
  - [-1, 2, C2f, [256]]                        # 6
  - [-1, 1, Conv_TODAM, [256, 3, 1]]           # 7
  - [-1, 1, Conv_ZoomAtt, [512, 3, 2]]         # 8 - P4/16
  - [-1, 2, C2f, [512]]                        # 9
  - [-1, 1, Conv_TODAM, [512, 3, 1]]           # 10
  - [-1, 1, Conv_ZoomAtt, [1024, 3, 2]]        # 11 - P5/32
  - [-1, 2, C2f, [1024]]                       # 12
  - [-1, 1, Conv_TODAM, [1024, 3, 1]]          # 13
  - [-1, 1, SPPF, [1024, 5]]                   # 14

# -----------------------
# Head (Neck + Detection)
# -----------------------
head:
  - [-1, 1, Conv_TODAM, [512, 3, 1]]           # 15
  - [-1, 1, Conv, [512, 1, 1]]                 # 16
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [[-1, 10], 1, Concat, [1]]                 # 18 - P4
  - [-1, 3, C2f, [512]]                        # 19

  - [-1, 1, Conv, [256, 1, 1]]                 # 20
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21
  - [[-1, 7], 1, Concat, [1]]                  # 22 - P3
  - [-1, 3, C2f, [256]]                        # 23

  - [-1, 1, Conv, [128, 1, 1]]                 # 24
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 25
  - [[-1, 3], 1, Concat, [1]]                  # 26 - P2
  - [-1, 2, C2f, [128]]                        # 27

  - [-1, 1, Conv, [256, 3, 2]]                 # 28
  - [[-1, 23], 1, Concat, [1]]                 # 29
  - [-1, 3, C2f, [512]]                        # 30

  - [-1, 1, Conv, [512, 3, 2]]                 # 31
  - [[-1, 19], 1, Concat, [1]]                 # 32
  - [-1, 3, C2f, [1024]]                       # 33

  - [[27, 30, 33], 1, Detect, [nc]]            # 34 - Detect(P2, P3, P4)
